In [1]:
import pandas as pd

In [2]:
person = {
    'first': "Asghar",
    'last' : "abbasi",
    'email': "abc@gmail.com"
}

In [3]:
people = {
    'first': ['Azhar'],
    'last' : ["Ali"],
    'email': ['Azhar@gmail.com']
}

In [4]:
people = {
    'first': ['Azhar', 'Ali', 'sahito'],
    'last' : ["Ali", "Sahito", "Azhar"],
    'email': ['Azhar@gmail.com', 'ali@gmail.com', 'sahito@gmail.com']
}

In [5]:
df = pd.DataFrame(people)
df

    first    last             email
0   Azhar     Ali   Azhar@gmail.com
1     Ali  Sahito     ali@gmail.com
2  sahito   Azhar  sahito@gmail.com

In [6]:
df['email'] # preferred

0     Azhar@gmail.com
1       ali@gmail.com
2    sahito@gmail.com
Name: email, dtype: object

In [7]:
df.email

0     Azhar@gmail.com
1       ali@gmail.com
2    sahito@gmail.com
Name: email, dtype: object

In [8]:
df[['first','last']] # accessing multiple columns

    first    last
0   Azhar     Ali
1     Ali  Sahito
2  sahito   Azhar

In [9]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [10]:
df.iloc[2]  # index location

first              sahito
last                Azhar
email    sahito@gmail.com
Name: 2, dtype: object

In [11]:
df.iloc[[0,1]]  # index location

   first    last            email
0  Azhar     Ali  Azhar@gmail.com
1    Ali  Sahito    ali@gmail.com

In [12]:
df.iloc[[0,1],2]  # index location with specified column

0    Azhar@gmail.com
1      ali@gmail.com
Name: email, dtype: object

In [13]:
df.loc[[0,1]]

   first    last            email
0  Azhar     Ali  Azhar@gmail.com
1    Ali  Sahito    ali@gmail.com

In [14]:
df.loc[[0,1],'last']

0       Ali
1    Sahito
Name: last, dtype: object

In [15]:
# df.set_index('email', inplace=True)

In [16]:
# df

In [17]:
# df.loc['Azhar@gmail.com']

**Filtering Data**

In [18]:
filt = (df['last'] == 'Ali')

In [19]:
df[filt]
df.loc[filt] #both wrok same but in loc we can pass column name like df.loc[filt,'last']

   first last            email
0  Azhar  Ali  Azhar@gmail.com

**Updating Rows and Columns**

In [20]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [21]:
df.columns = ['first name','last name','User_email'] # Changing columns name method 1
df.columns

Index(['first name', 'last name', 'User_email'], dtype='object')

In [22]:
df.columns = [x.upper() for x in df.columns] # upper case columns names
df.columns

Index(['FIRST NAME', 'LAST NAME', 'USER_EMAIL'], dtype='object')

In [23]:
df.columns = df.columns.str.replace(' ','_')
df.columns

Index(['FIRST_NAME', 'LAST_NAME', 'USER_EMAIL'], dtype='object')

In [24]:
df.rename(columns={'FIRST_NAME':'first', 'LAST_NAME':"last"}, inplace=True) # Changing columns name method 2
df.rename(columns={'USER_EMAIL':'email'}, inplace=True)
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [25]:
df.loc[2] = ['Zohaib', 'chandio', 'ZOHAIB12@gmail.com'] # changing Row data 
print(df.loc[2])
df

first                Zohaib
last                chandio
email    ZOHAIB12@gmail.com
Name: 2, dtype: object

    first     last               email
0   Azhar      Ali     Azhar@gmail.com
1     Ali   Sahito       ali@gmail.com
2  Zohaib  chandio  ZOHAIB12@gmail.com

In [26]:
df.loc[1,['first','email']] = ['Raza', 'raza1@gmail.com']
df

    first     last               email
0   Azhar      Ali     Azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  ZOHAIB12@gmail.com

In [27]:
df.loc[0,'last'] ='Sahito' #change single value method 1
# df.at[0,'last'] = "ALI"    #method 2
df

    first     last               email
0   Azhar   Sahito     Azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  ZOHAIB12@gmail.com

In [35]:
df['email'] = df['email'].str.lower() #Changing into lower case all emails both methods work same
df['email'].str.lower()
df

    first     last               email
0   Azhar   Sahito     azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  zohaib12@gmail.com

In [36]:
df['email'].apply(len) # gives length of emails

0    15
1    15
2    18
Name: email, dtype: int64

In [39]:
def update_email(email):
    return email.upper()
df['email'].apply(update_email)
df

    first     last               email
0   Azhar   Sahito     azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  zohaib12@gmail.com